# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

print(str(bin(int(input('Введите число для преобразования: '))))[2:])